Revit 2027 API
BaseExportOptions.HideReferencePlane Property
 Whether or not to hide reference planes. Default value is false.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HideReferencePlane { get; set; }
Public Property HideReferencePlane As Boolean
	Get
	Set
public:
property bool HideReferencePlane {
	bool get ();
	void set (bool value);
}
member HideReferencePlane : bool with get, set
Property Value
Boolean
See Also
Reference
BaseExportOptions Class
Autodesk.Revit.DB Namespace